In [79]:
import pandas as pd

Series: A 1D labeled array 

DataFrame: A 2D labeled data structure

In [80]:
data = {
    'name': ['rahul', 'vidu', 'paru'],
    'age': [20, 21, 19],
    'marks': [90, 80, 70]
}

df = pd.DataFrame(data, index=[40, 41, 42])
df
df.loc[40]
df.iloc[0]

     name  age  marks
40  rahul   20     90
41   vidu   21     80
42   paru   19     70

name     rahul
age         20
marks       90
Name: 40, dtype: object

name     rahul
age         20
marks       90
Name: 40, dtype: object

In [81]:
df = pd.DataFrame(data)

In [82]:
df.index
df.columns
df.values
df.value_counts()

RangeIndex(start=0, stop=3, step=1)

Index(['name', 'age', 'marks'], dtype='object')

array([['rahul', 20, 90],
       ['vidu', 21, 80],
       ['paru', 19, 70]], dtype=object)

name   age  marks
paru   19   70       1
rahul  20   90       1
vidu   21   80       1
Name: count, dtype: int64

In [83]:
df['name']
type(df['name'])

0    rahul
1     vidu
2     paru
Name: name, dtype: object

pandas.core.series.Series

In [84]:
df[['name', 'marks']]
type(df[['name', 'marks']])

    name  marks
0  rahul     90
1   vidu     80
2   paru     70

pandas.core.frame.DataFrame

In [85]:
df['name'][0]
df['name'][:2]

'rahul'

0    rahul
1     vidu
Name: name, dtype: object

In [86]:
# df.loc[row label, col label]
# label: scalar, list, range
df.loc[0]
df.loc[0, 'name']
df.loc[2, ['name', 'age']]
df.loc[:1, ['name', 'age']]
df.loc[:1, 'name': 'marks']

name     rahul
age         20
marks       90
Name: 0, dtype: object

'rahul'

name    paru
age       19
Name: 2, dtype: object

    name  age
0  rahul   20
1   vidu   21

    name  age  marks
0  rahul   20     90
1   vidu   21     80

In [87]:
df.iloc[0]
df.iloc[0, 1]
df.iloc[:2, 1]

name     rahul
age         20
marks       90
Name: 0, dtype: object

np.int64(20)

0    20
1    21
Name: age, dtype: int64

In [88]:
df = pd.read_csv('data/customers-100.csv', index_col='Index')
df

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
Index,,,,,,,,,,,
1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/
...,...,...,...,...,...,...,...,...,...,...,...
96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/
97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/
98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/
99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/
100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

In [89]:
df.columns
df.index

Index(['Customer Id', 'First Name', 'Last Name', 'Company', 'City', 'Country',
       'Phone 1', 'Phone 2', 'Email', 'Subscription Date', 'Website'],
      dtype='object')

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,  14,
        15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,  28,
        29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,  40,  41,  42,
        43,  44,  45,  46,  47,  48,  49,  50,  51,  52,  53,  54,  55,  56,
        57,  58,  59,  60,  61,  62,  63,  64,  65,  66,  67,  68,  69,  70,
        71,  72,  73,  74,  75,  76,  77,  78,  79,  80,  81,  82,  83,  84,
        85,  86,  87,  88,  89,  90,  91,  92,  93,  94,  95,  96,  97,  98,
        99, 100],
      dtype='int64', name='Index')

In [90]:
df['Phone 1']
df[['Phone 1', 'Phone 2']]

Index
1                229.077.5154
2                  5153435776
3             +1-539-402-0259
4      001-808-617-6467x12895
5      001-234-203-0635x76146
                ...
96        (188)169-1674x58692
97            +1-846-706-2218
98       +1-753-067-8419x7170
99              (530)311-9786
100             (753)813-6941
Name: Phone 1, Length: 100, dtype: object

                      Phone 1                 Phone 2
Index
1                229.077.5154        397.884.0519x718
2                  5153435776        686-620-1820x944
3             +1-539-402-0259     (496)978-3969x58947
4      001-808-617-6467x12895         +1-813-324-8756
5      001-234-203-0635x76146   001-199-446-3860x3486
...                       ...                     ...
96        (188)169-1674x58692    001-841-293-3519x614
97            +1-846-706-2218            605.413.3198
98       +1-753-067-8419x7170   +1-632-666-7507x92121
99              (530)311-9786  001-869-452-0943x12424
100             (753)813-6941            783.639.1472

[100 rows x 2 columns]

In [91]:
df = pd.read_json('data/64KB.json')
df.columns

Index(['name', 'language', 'id', 'bio', 'version'], dtype='object')

In [92]:
df = pd.read_csv('data/customers-100.csv', index_col='Index')
df.head(1)
df.tail(1)

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
Index,,,,,,,,,,,
1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
Index,,,,,,,,,,,
100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

In [93]:
df.sample(3)

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
Index,,,,,,,,,,,
37,889eCf90f68c5Da,Nicholas,Sosa,Jordan Ltd,South Hunter,Uruguay,(661)425-6042,975-998-1519,fwolfe@dorsey.com,2021-08-10,https://www.fleming-richards.com/
66,fF1b6c9E8Fbf1ff,Fernando,Lambert,Church-Banks,Lake Nancy,Lithuania,497.829.9038,3863743398,fisherlinda@schaefer.net,2021-04-23,https://www.vang.com/
3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 1 to 100
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Customer Id        100 non-null    object
 1   First Name         100 non-null    object
 2   Last Name          100 non-null    object
 3   Company            100 non-null    object
 4   City               100 non-null    object
 5   Country            100 non-null    object
 6   Phone 1            100 non-null    object
 7   Phone 2            100 non-null    object
 8   Email              100 non-null    object
 9   Subscription Date  100 non-null    object
 10  Website            100 non-null    object
dtypes: object(11)
memory usage: 9.4+ KB

In [95]:
df.describe()
# top: most frequent

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
count,100,100,100,100,100,100,100,100,100,100,100
unique,100,93,97,99,100,85,100,100,100,96,100
top,DD37Cf93aecA6Dc,Sheryl,Foley,Simon LLC,East Leonard,Solomon Islands,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2021-04-23,http://www.stephenson.com/
freq,1,2,2,2,1,4,1,1,1,2,1

In [96]:
df['Country'].value_counts()
df['First Name'].value_counts()

Country
Solomon Islands       4
Sri Lanka             2
Oman                  2
Togo                  2
Dominican Republic    2
                     ..
Anguilla              1
Mali                  1
Guyana                1
Aruba                 1
Honduras              1
Name: count, Length: 85, dtype: int64

First Name
Sheryl      2
Joanna      2
Faith       2
Shane       2
Tom         2
           ..
Darrell     1
Karl        1
Fred        1
Yvonne      1
Clarence    1
Name: count, Length: 93, dtype: int64

In [97]:
url = 'https://en.wikipedia.org/wiki/List_of_countries_by_population_(United_Nations)'

# Pass the 'User-Agent' header to mimic a browser
tables = pd.read_html(
    url,
    storage_options={'User-Agent': 'Mozilla/5.0'}
)

df_population = tables[0]
df_population

,Country or territory,Population (1 July 2022),Population (1 July 2023),Change (%),UN continental region[1],UN statistical subregion[1]
0,World,8021407192,8091734930,+0.88%,–,–
1,India,1425423212,1438069596,+0.89%,Asia,Southern Asia
2,China[a],1425179569,1422584933,−0.18%,Asia,Eastern Asia
3,United States,341534046,343477335,+0.57%,Americas,Northern America
4,Indonesia,278830529,281190067,+0.85%,Asia,South-eastern Asia
...,...,...,...,...,...,...
233,Montserrat (United Kingdom),4453,4420,−0.74%,Americas,Caribbean
234,Falkland Islands (United Kingdom),3490,3477,−0.37%,Americas,South America
235,Tokelau (New Zealand),2290,2397,+4.67%,Oceania,Polynesia
236,Niue,1821,1817,−0.22%,Oceania,Polynesia
237,Vatican City[w],505,496,−1.78%,Europe,Southern Europe

In [98]:
df_population['UN continental region[1]'].value_counts()
df_population.describe()

UN continental region[1]
Africa      58
Americas    55
Asia        51
Europe      50
Oceania     23
–            1
Name: count, dtype: int64

       Population (1 July 2022)  Population (1 July 2023)
count              2.380000e+02              2.380000e+02
mean               6.740799e+07              6.799454e+07
std                5.353495e+08              5.398839e+08
min                5.050000e+02              4.960000e+02
25%                3.988368e+05              4.023565e+05
50%                5.465499e+06              5.518611e+06
75%                2.275348e+07              2.324430e+07
max                8.021407e+09              8.091735e+09

In [99]:
mask = df_population['Population (1 July 2022)'] < 10000
mask.sum()
df_population[mask]

np.int64(8)

,Country or territory,Population (1 July 2022),Population (1 July 2023),Change (%),UN continental region[1],UN statistical subregion[1]
230,Tuvalu,9992,9816,−1.76%,Oceania,Polynesia
231,Saint Pierre and Miquelon (France),5732,5681,−0.89%,Americas,Northern America
232,Saint Helena (United Kingdom)[v],5343,5289,−1.01%,Africa,Western Africa
233,Montserrat (United Kingdom),4453,4420,−0.74%,Americas,Caribbean
234,Falkland Islands (United Kingdom),3490,3477,−0.37%,Americas,South America
235,Tokelau (New Zealand),2290,2397,+4.67%,Oceania,Polynesia
236,Niue,1821,1817,−0.22%,Oceania,Polynesia
237,Vatican City[w],505,496,−1.78%,Europe,Southern Europe

In [100]:
mask = (df_population['Population (1 July 2022)'] < 10000) & (
    df_population['UN continental region[1]'] == 'Oceania')

mask.sum()
df_population[mask]

np.int64(3)

,Country or territory,Population (1 July 2022),Population (1 July 2023),Change (%),UN continental region[1],UN statistical subregion[1]
230,Tuvalu,9992,9816,−1.76%,Oceania,Polynesia
235,Tokelau (New Zealand),2290,2397,+4.67%,Oceania,Polynesia
236,Niue,1821,1817,−0.22%,Oceania,Polynesia

In [103]:
df.query('Company == "Carey LLC"')

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
Index,,,,,,,,,,,
96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/

In [107]:
df_population.isnull()  # bool
df_population.isnull().sum()  # col count

,Country or territory,Population (1 July 2022),Population (1 July 2023),Change (%),UN continental region[1],UN statistical subregion[1]
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
233,False,False,False,False,False,False
234,False,False,False,False,False,False
235,False,False,False,False,False,False
236,False,False,False,False,False,False
237,False,False,False,False,False,False

Country or territory           0
Population (1 July 2022)       0
Population (1 July 2023)       0
Change (%)                     0
UN continental region[1]       0
UN statistical subregion[1]    0
dtype: int64

In [119]:
my_data = {
    'name': [None, 'vishnu', 'paru', 'rahul', 'maa'],
    'age': [None, 30, None, 59, 70],
    'marks': [90, None, 30, None, 100],
}

df = pd.DataFrame(my_data)
df

     name   age  marks
0    None   NaN   90.0
1  vishnu  30.0    NaN
2    paru   NaN   30.0
3   rahul  59.0    NaN
4     maa  70.0  100.0

In [115]:
df.info()
df.isnull()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     2 non-null      float64
 2   marks   2 non-null      float64
dtypes: float64(2), object(1)
memory usage: 228.0+ bytes

    name    age  marks
0  False   True  False
1  False  False   True
2  False   True  False
3  False  False   True

name     0
age      2
marks    2
dtype: int64

In [121]:
df
df.dropna()

     name   age  marks
0    None   NaN   90.0
1  vishnu  30.0    NaN
2    paru   NaN   30.0
3   rahul  59.0    NaN
4     maa  70.0  100.0

  name   age  marks
4  maa  70.0  100.0

In [176]:
df.fillna(0)
df['name'].fillna('Unknown')
df[['age', 'marks']].fillna(0)
df.fillna({
    'age': 20,
    'marks': 30,
})

     name  age  marks  salary place
0    vidu   30     90    1000   hbh
1  vishnu   30     50    2000   mbr
2    paru   30     30    1000   hbh
3   rahul   59     80    2000   mbr
4     maa   70    100    1000   mbr

0      vidu
1    vishnu
2      paru
3     rahul
4       maa
Name: name, dtype: object

   age  marks
0   30     90
1   30     50
2   30     30
3   59     80
4   70    100

     name  age  marks  salary place
0    vidu   30     90    1000   hbh
1  vishnu   30     50    2000   mbr
2    paru   30     30    1000   hbh
3   rahul   59     80    2000   mbr
4     maa   70    100    1000   mbr

In [141]:
df[['age', 'marks']].fillna({
    'age': df['age'].mean(),
    'marks': df['marks'].mean()
}, inplace=True)

C:\Users\vidha\AppData\Local\Temp\ipykernel_18016\966723811.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['age', 'marks']].fillna({

In [142]:
df['salary'] = df['age'] * df['marks']

df

     name   age  marks  salary
0    None   NaN   90.0     NaN
1  vishnu  30.0    NaN     NaN
2    paru   NaN   30.0     NaN
3   rahul  59.0    NaN     NaN
4     maa  70.0  100.0  7000.0

In [148]:
df.columns
df.dtypes
df.select_dtypes(include=['number'])  # numeric cols
df.select_dtypes(include=['object'])  # categorical cols

Index(['name', 'age', 'marks', 'salary'], dtype='object')

name       object
age       float64
marks     float64
salary    float64
dtype: object

    age  marks  salary
0   NaN   90.0     NaN
1  30.0    NaN     NaN
2   NaN   30.0     NaN
3  59.0    NaN     NaN
4  70.0  100.0  7000.0

     name
0    None
1  vishnu
2    paru
3   rahul
4     maa

In [153]:
my_data = {
    'name': ['vidu', 'vishnu', 'paru', 'rahul', 'maa'],
    'age': [30, 30, 30, 59, 70],
    'marks': [90, 50, 30, 80, 100],
    'salary': [1000, 2000, 1000, 2000, 1000],
    'place': ['hbh', 'mbr', 'hbh', 'mbr', 'mbr'],
}

df = pd.DataFrame(my_data)
df

     name  age  marks  salary place
0    vidu   30     90    1000   hbh
1  vishnu   30     50    2000   mbr
2    paru   30     30    1000   hbh
3   rahul   59     80    2000   mbr
4     maa   70    100    1000   mbr

In [157]:
df.groupby('salary').groups
df.groupby('place').groups
df.groupby('age').get_group(30)
df.groupby('place').get_group('mbr')

{1000: [0, 2, 4], 2000: [1, 3]}

{'hbh': [0, 2], 'mbr': [1, 3, 4]}

     name  age  marks  salary place
0    vidu   30     90    1000   hbh
1  vishnu   30     50    2000   mbr
2    paru   30     30    1000   hbh

     name  age  marks  salary place
1  vishnu   30     50    2000   mbr
3   rahul   59     80    2000   mbr
4     maa   70    100    1000   mbr

In [164]:
df
df.groupby('place')['marks'].mean()
df.groupby('place')['salary'].max()

     name  age  marks  salary place
0    vidu   30     90    1000   hbh
1  vishnu   30     50    2000   mbr
2    paru   30     30    1000   hbh
3   rahul   59     80    2000   mbr
4     maa   70    100    1000   mbr

place
hbh    60.000000
mbr    76.666667
Name: marks, dtype: float64

place
hbh    1000
mbr    2000
Name: salary, dtype: int64

In [168]:
for name, group in df.groupby('place'):
  group

   name  age  marks  salary place
0  vidu   30     90    1000   hbh
2  paru   30     30    1000   hbh

     name  age  marks  salary place
1  vishnu   30     50    2000   mbr
3   rahul   59     80    2000   mbr
4     maa   70    100    1000   mbr

In [175]:
import seaborn as sns

sns.load_dataset('titanic').head(3)
sns.load_dataset('iris').head(3)
sns.load_dataset('tips').head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3